--文件是自动生成,请勿手动修改.来自数据文件:shenwu_addatt
local M = {
   [1] = {21816, 511, 1, 50081, 21817, 1},
   [2] = {21818, 467, 2, 50082, 21817, 1},
   [3] = {21819, 3284, 3, 50083, 21820, 1},
   [4] = {21821, 423, 4, 50078, 21817, 2},
   [5] = {21822, 555, 5, 50079, 21817, 2},
   [6] = {21823, 3146, 6, 50080, 21820, 2},
   [7] = {21824, 1086, 7, 50084, 21817, 3},
   [8] = {21825, 1291, 8, 50085, 21817, 3},
   [9] = {21826, 8014, 9, 50086, 21820, 3},
   [10] = {21827, 442, 10, 50087, 21817, 4},
   [11] = {21828, 542, 11, 50088, 21817, 4},
   [12] = {21829, 3228, 12, 50089, 21820, 4},
   [13] = {21830, 442, 13, 50104, 21817, 5},
   [14] = {21831, 542, 14, 50105, 21817, 5},
   [15] = {21832, 3228, 15, 50106, 21820, 5},
   [16] = {21833, 442, 16, 50104, 21817, 6},
   [17] = {21834, 542, 17, 50105, 21817, 6},
   [18] = {21835, 3228, 18, 50106, 21820, 6},
   [19] = {21830, 442, 19, 50104, 21817, 7},
   [20] = {21831, 542, 20, 50105, 21817, 7},
   [21] = {21832, 3228, 21, 50106, 21820, 7},
}
local _namesByNum = {
   Fightnum = 2,
   Id = 3,
   ItemId = 4,
   Type = 6,
}
local _namesByString = {
   Attribute = 1,
   LeveLimit = 5,
}
local mt = {}
mt.__index = function (t,key)
    local _value = _namesByNum[key]
    if _value ~= nil then
        return t[_value]
    end
    _value = _namesByString[key]
    if _value ~= nil then
        return StringDefines[t[_value]]
    end
    if key ~= "_OnCopyAfter_" then
        Debug.LogError(string.format("不存在 key = %s", key))
    end
end
for _,v in pairs(M) do
    setmetatable(v,mt)
end
return M
