--文件是自动生成,请勿手动修改.来自数据文件:Equip_star
local M = {
   [1] = {500, 0, 1, 0, 22138, 5000, 22139, 22140, 1, 10000},
   [2] = {1000, 0, 2, 0, 22138, 10000, 22139, 22140, 1, 10000},
   [3] = {1500, 0, 3, 0, 22138, 20000, 22139, 22140, 1, 9000},
   [4] = {2000, 0, 4, 0, 22138, 30000, 22139, 22140, 1, 8000},
   [5] = {2500, 0, 5, 0, 22138, 40000, 22139, 22140, 1, 7000},
   [6] = {3000, 0, 6, 0, 22138, 50000, 22139, 22140, 1, 6000},
   [7] = {3500, 1, 7, 0, 22141, 62500, 22139, 22140, 22142, 5000},
   [8] = {4500, 1, 8, 0, 22143, 75000, 22139, 22140, 22142, 4500},
   [9] = {5500, 1, 9, 0, 22144, 100000, 22139, 22140, 22145, 4000},
   [10] = {6500, 1, 10, 0, 22146, 150000, 22139, 22140, 22147, 3500},
   [11] = {7500, 0, 11, 0, 22148, 300000, 22149, 22150, 22151, 3000},
   [12] = {8500, 1, 12, 0, 22152, 350000, 22149, 22150, 22153, 2500},
   [13] = {9500, 1, 13, 0, 22154, 400000, 22149, 22150, 22155, 2500},
   [14] = {10500, 1, 14, 0, 22156, 450000, 22149, 22150, 22157, 2500},
   [15] = {11500, 1, 15, 0, 22158, 600000, 22149, 22150, 22159, 2500},
}
local _namesByNum = {
   Attribute = 1,
   DeclineLevel = 2,
   Id = 3,
   Level = 4,
   Money = 6,
   SuccessRatio = 10,
}
local _namesByString = {
   Material1 = 5,
   PublicN = 7,
   PublicP = 8,
   SpecialMaterial = 9,
}
local mt = {}
mt.__index = function (t,key)
    local _value = _namesByNum[key]
    if _value ~= nil then
        return t[_value]
    end
    _value = _namesByString[key]
    if _value ~= nil then
        return StringDefines[t[_value]]
    end
    if key ~= "_OnCopyAfter_" then
        Debug.LogError(string.format("不存在 key = %s", key))
    end
end
for _,v in pairs(M) do
    setmetatable(v,mt)
end
return M
