--文件是自动生成,请勿手动修改.来自数据文件:GmMainFunction
local M = {
   [1] = {21138, 1, 1, 21139},
   [2] = {21141, 3, 2, 21142},
   [3] = {18253, 5, 3, 21143},
   [4] = {21149, 7, 4, 21150},
   [5] = {21157, 9, 5, 4814},
   [6] = {21158, 1, 6, 5056},
   [7] = {21159, 3, 7, 21160},
   [8] = {21161, 5, 8, 4808},
   [9] = {21162, 7, 9, 5696},
   [10] = {21163, 9, 10, 21164},
   [11] = {21165, 1, 11, 5366},
   [12] = {21166, 3, 12, 4818},
   [13] = {21167, 5, 13, 21168},
   [14] = {21169, 7, 14, 11651},
   [15] = {21170, 9, 15, 5013},
   [16] = {21171, 1, 16, 21172},
   [17] = {21173, 3, 17, 4984},
   [18] = {21174, 5, 18, 21175},
   [19] = {21176, 7, 19, 4923},
   [20] = {21177, 9, 20, 21178},
   [21] = {21179, 1, 21, 21180},
   [22] = {21181, 3, 22, 21182},
   [23] = {21183, 5, 23, 4913},
   [24] = {21184, 7, 24, 21188},
   [25] = {21189, 9, 25, 21190},
   [26] = {21192, 1, 26, 21193},
   [27] = {21194, 3, 27, 21195},
   [28] = {21196, 5, 28, 4912},
   [29] = {21197, 7, 29, 21198},
}
local _namesByNum = {
   Icon = 2,
   Id = 3,
}
local _namesByString = {
   BranchFunction = 1,
   Name = 4,
}
local mt = {}
mt.__index = function (t,key)
    local _value = _namesByNum[key]
    if _value ~= nil then
        return t[_value]
    end
    _value = _namesByString[key]
    if _value ~= nil then
        return StringDefines[t[_value]]
    end
    if key ~= "_OnCopyAfter_" then
        Debug.LogError(string.format("不存在 key = %s", key))
    end
end
for _,v in pairs(M) do
    setmetatable(v,mt)
end
return M
