--文件是自动生成,请勿手动修改.来自数据文件:Rank_base
local M = {
   [101] = {0, 101, 1, 16690, 0, 100, 2, 1, 1, 43052, 16690},
   [102] = {0, 102, 1, 16724, 0, 100, 1, 2, 1, 43052, 16724},
   [103] = {0, 103, 1, 5366, 0, 100, 10, 3, 1, 43052, 16724},
   [104] = {0, 104, 1, 5696, 0, 100, 7, 4, 1, 43052, 16724},
   [105] = {0, 105, 1, 21143, 0, 100, 9, 5, 1, 43052, 16724},
   [106] = {0, 106, 1, 43051, 0, 100, 0, 6, 1, 43052, 16724},
   [107] = {0, 107, 1, 3263, 0, 100, 41, 7, 1, 43052, 16724},
   [108] = {0, 108, 1, 17061, 0, 100, 42, 8, 1, 43052, 16724},
   [109] = {0, 109, 1, 24318, 0, 100, 43, 9, 1, 43052, 16724},
   [110] = {0, 110, 1, 24094, 0, 100, 44, 10, 1, 43052, 16724},
   [111] = {127, 111, 1, 43050, 0, 100, 44, 11, 1, 43052, 43050},
   [201] = {127, 201, 1, 4566, 0, 100, 45, 1, 2, 43049, 43048},
   [202] = {127, 202, 1, 43047, 0, 100, 0, 2, 2, 43049, 43048},
   [301] = {127, 301, 1, 43046, 0, 100, 0, 1, 3, 23059, 16724},
   [401] = {1, 401, 1, 43045, 0, 100, 0, 1, 4, 43044, 43043},
   [402] = {1, 402, 1, 43042, 0, 100, 13, 2, 4, 43044, 43041},
}
local _namesByNum = {
   CleanWeek = 1,
   Id = 2,
   ModelType = 3,
   Pic = 5,
   RankNum = 6,
   ServerEnum = 7,
   Sort = 8,
   Type = 9,
}
local _namesByString = {
   Name = 4,
   TypeName = 10,
   UiValueDes = 11,
}
local mt = {}
mt.__index = function (t,key)
    local _value = _namesByNum[key]
    if _value ~= nil then
        return t[_value]
    end
    _value = _namesByString[key]
    if _value ~= nil then
        return StringDefines[t[_value]]
    end
    if key ~= "_OnCopyAfter_" then
        Debug.LogError(string.format("不存在 key = %s", key))
    end
end
for _,v in pairs(M) do
    setmetatable(v,mt)
end
return M
