--文件是自动生成,请勿手动修改.来自数据文件:Cinematic
local M = {
   [1] = {1, 1, 20829, 1, 1, 3, 0},
   [5] = {1, 5, 20830, 0, 0, 2, 0},
   [6] = {1, 6, 20831, 0, 0, 0, 101},
   [7] = {1, 7, 20832, 0, 0, 2, 201},
   [8] = {1, 8, 20833, 0, 0, 2, 201},
   [9] = {1, 9, 20833, 0, 0, 2, 202},
   [10] = {20834, 10, 20835, 0, 0, 1, 599913},
   [11] = {1, 11, 20836, 0, 0, 2, 605},
   [12] = {1, 12, 20837, 0, 0, 2, 606},
   [13] = {1, 13, 20838, 0, 0, 2, 607},
   [14] = {1, 14, 20839, 0, 0, 2, 608},
   [15] = {1, 15, 20840, 0, 0, 2, 609},
   [16] = {1, 16, 20841, 0, 0, 2, 610},
   [17] = {1, 17, 20842, 0, 0, 2, 611},
   [18] = {1, 18, 20843, 0, 0, 2, 612},
   [19] = {1, 19, 20844, 0, 0, 2, 613},
   [20] = {20845, 20, 20846, 0, 0, 1, 510014},
   [21] = {1, 21, 20846, 0, 0, 0, 0},
   [22] = {1, 22, 20847, 1, 1, 3, 0},
   [23] = {1, 23, 20848, 1, 1, 3, 0},
   [24] = {20849, 24, 20850, 1, 1, 3, 0},
   [25] = {1, 25, 20851, 1, 1, 3, 0},
   [26] = {1, 26, 20852, 1, 1, 3, 0},
   [27] = {1, 27, 20853, 1, 1, 3, 0},
   [28] = {1, 28, 20854, 0, 0, 2, 52001},
}
local _namesByNum = {
   Id = 2,
   Skip = 4,
   ToBlack = 5,
   Type = 6,
   TypeId = 7,
}
local _namesByString = {
   FlyTo = 1,
   Path = 3,
}
local mt = {}
mt.__index = function (t,key)
    local _value = _namesByNum[key]
    if _value ~= nil then
        return t[_value]
    end
    _value = _namesByString[key]
    if _value ~= nil then
        return StringDefines[t[_value]]
    end
    if key ~= "_OnCopyAfter_" then
        Debug.LogError(string.format("不存在 key = %s", key))
    end
end
for _,v in pairs(M) do
    setmetatable(v,mt)
end
return M
